salon_app/app/views/appointments/new.html.erb

SELECT "services".* FROM "services"
---
		<table padding="10">
		<% Service.all.each do |serv| %>