salon_app/app/controllers/appointments_controller.rb

SELECT "services".* FROM "services"
---
  def new
  	@appointment = Appointment.new

  	@services = Service.all