salon_app/app/controllers/users_controller.rb

INSERT INTO "users" ("address1", "address2", "admin", "created_at", "dob", "email", "employee", "first_name", "lastAppointment", "last_name", "password_digest", "phone_number", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
   def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "email" = 'ferrar06@students.rowan.edu', "phone_number" = '', "address1" = '', "address2" = 'example@railstutorial.org', "password_digest" = '$2a$10$FlDAMYm1FAcwnLiPNyDcMOzvndZKqVy19k25ln7QhvKijSGOR7eTW', "remember_token" = 'gDQKZiOhOnlzkWGHFSLQ7w', "updated_at" = '2013-03-13 23:47:16.724600' WHERE "users"."id" = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])